## Leetcode Database exercise
[Comparison with sql](https://pandas.pydata.org/pandas-docs/stable/comparison_with_sql.html)

627.[swap salary](https://leetcode.com/problems/swap-salary/description/)

Swap all f and m values

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'id':np.arange(4), 'name':list('ABCD'), 'sex':['f', 'm']*2, 'salary': np.random.randint(1000,5000,4)})

In [5]:
df

   id name  salary sex
0   0    A    4961   f
1   1    B    1741   m
2   2    C    4788   f
3   3    D    2495   m

In [6]:
df['sex'] = df['sex'].map({'f':'m', 'm':'f'})

In [7]:
df

   id name  salary sex
0   0    A    4961   m
1   1    B    1741   f
2   2    C    4788   m
3   3    D    2495   f

In [9]:
df['sex'] = df['sex'].transform(lambda x: 'm' if x == 'f' else 'f')

In [10]:
df

   id name  salary sex
0   0    A    4961   f
1   1    B    1741   m
2   2    C    4788   f
3   3    D    2495   m

In [ ]:
# UPDATE salary
# SET sex = IF(sex='f','m','f');

176.Second Highest Salary

Write a SQL query to get the second highest salary from the Employee table.

In [13]:
s = pd.Series(np.random.choice([1000, 2000, 3000], 10), name='salary')

In [23]:
unique_salary = sorted(s.unique(), reverse=True)

In [ ]:
# SELECT
#     IFNULL(
#       (SELECT DISTINCT Salary
#        FROM Employee
#        ORDER BY Salary DESC
#         LIMIT 1 OFFSET 1),
#     NULL) AS SecondHighestSalary

197.rising temperature

Given a Weather table, write a SQL query to find all dates' Ids with higher temperature compared to its previous (yesterday's) dates.

In [26]:
s = pd.Series(np.random.randint(20, 25, 5), index=pd.date_range('2018-01-01', freq='D',periods=5))

In [27]:
s

2018-01-01    20
2018-01-02    24
2018-01-03    23
2018-01-04    23
2018-01-05    21
Freq: D, dtype: int64

In [31]:
s[s.diff() > 0].index

DatetimeIndex(['2018-01-02'], dtype='datetime64[ns]', freq='D')

In [ ]:
# select a.Id from Weather a, Weather b 
# where a.Temperature > b.Temperature
# and DATEDIFF(a.RecordDate, b.RecordDate)=1

181.Employees Earning More Than Their Managers

Given the Employee table, write a SQL query that finds out employees who earn more than their managers.

In [32]:
df = pd.DataFrame({'Id':np.arange(1,5), 
                   'Name': list('ABCD'),
                   'Salary': [70000, 80000, 60000, 90000],
                   'ManagerId': [3,4,np.nan,np.nan]})

In [45]:
df

   Id  ManagerId Name  Salary
0   1        3.0    A   70000
1   2        4.0    B   80000
2   3        NaN    C   60000
3   4        NaN    D   90000

In [44]:
merged = df.merge(df, left_on='Id', right_on='ManagerId')
merged.loc[merged['Salary_y'] > merged['Salary_x'], 'Id_y']

0    1
Name: Id_y, dtype: object

In [ ]:
# select a.Name as Employee
# from Employee a, Employee b
# where a.ManagerId = b.Id and a.Salary > b.Salary

183.Customers Who Never Order

Write a SQL query to find all customers who never order anything.

In [46]:
s1 = pd.DataFrame({'id':np.arange(1,5), 'customer': list('abcd')})
s2 = pd.Series([3,1])

In [48]:
s1.loc[~s1.id.isin(s2), 'customer']

1    b
3    d
Name: customer, dtype: object

In [ ]:
# select Name as Customers
# from Customers
# where Id not in (select CustomerId from Orders)

596.Classes More Than 5 Students

Please list out all classes which have more than or equal to 5 students.

In [53]:
df = pd.DataFrame({'student': np.random.choice(list('ABCDEFGHIJKLMN'), 15),
                   'class': np.random.choice(['Math', 'English', 'Biology', 'Computer'], 15, p=[0.5, 0.3, 0.1, 0.1])})

In [57]:
class_ct = df.groupby('class')['student'].apply(lambda x: x.nunique()) 
class_ct[class_ct>4].index.tolist()

['Math']

In [ ]:
# select class
# from courses
# group by class
# having count(distinct student) > 4

178.rank_score

Write a SQL query to rank scores. If there is a tie between two scores, both should have the same ranking. Note that after a tie, the next ranking number should be the next consecutive integer value. In other words, there should be no "holes" between ranks.

In [61]:
s = pd.Series([3.5, 3.65, 4, 3.85, 4, 3.65], name='Score')

In [81]:
s.rank(method='dense', ascending=False)

0    4.0
1    3.0
2    1.0
3    2.0
4    1.0
5    3.0
Name: Score, dtype: float64

In [82]:
unique_score=sorted(s.unique().tolist(), reverse=True)
s.map(dict(zip(unique_score, np.arange(len(unique_score))+1)))

0    4
1    3
2    1
3    2
4    1
5    3
Name: Score, dtype: int64

In [ ]:
# select Score, 
# (select count(distinct Score) From Scores where Score >=s.Score) as Rank
# from Scores as s
# order by Score desc

626.Exchange Seats

exchange seats for the adjacent students.

In [83]:
s = pd.Series(list('ABCDE'))

In [101]:
n = len(s)
new_idx = [i+1 if i%2==0 else i-1 for i in range(n//2*2)]
if n%2==1:
    new_idx += [n-1]
s[new_idx]

1    B
0    A
3    D
2    C
4    E
dtype: object

In [ ]:
# select 
# (case 
#  when mod(id,2)=1 and id=nrow then id
#  when mod(id,2)=1 then id+1
#  else id-1
#  end) as id, student
# from seat, (select count(*) as nrow from seat) as temp
# order by id asc

184.department_highest_salary

In [103]:
employee = pd.DataFrame({
    'name':list('abcd'),
    'salary':[7000,6000,8000,9000],
    'department':[1,2,2,1]
})
department = pd.DataFrame({
    'id': [1,2],
    'name':['IT','Sales']
})

In [105]:
temp=employee.merge(department, left_on='department', right_on='id')
temp.groupby('name_y').apply(lambda x: x[x.salary==x.salary.max()])

          department name_x  salary  id name_y
name_y
IT     1           1      d    9000   1     IT
Sales  3           2      c    8000   2  Sales

In [ ]:
# select d.Name as Department, e.Name as Employee, e.Salary
# from Employee as e
# join Department as d on e.DepartmentId=d.Id
# where (e.DepartmentId, e.Salary) in 
# (select DepartmentId, max(Salary)
# from Employee
# group by DepartmentId)

180.consecutive_number

Write a SQL query to find all numbers that appear at least three times consecutively.

In [108]:
s=pd.Series([1,1,1,2,1,2,2,1])

In [148]:
temp = s.groupby((s.diff()!=0).cumsum()).agg([np.mean, np.size])
temp.loc[temp['size']>2, 'mean'].unique().tolist()

[1]

In [ ]:
# select distinct a.Num as ConsecutiveNums
# from Logs a, Logs b, Logs c
# where a.Num=b.Num and b.Num=c.Num and a.id=b.id+1 and b.id=c.id+1

601.human_traffic_of_stadium

write a query to display the records which have 3 or more consecutive rows and the amount of people more than 100(inclusive).

In [155]:
s=pd.Series([10, 109, 150, 99, 145, 1455, 199, 188], index=pd.date_range('2017-01-02', periods=8, freq='D'))
s

2017-01-02      10
2017-01-03     109
2017-01-04     150
2017-01-05      99
2017-01-06     145
2017-01-07    1455
2017-01-08     199
2017-01-09     188
Freq: D, dtype: int64

In [169]:
s.groupby((s>=100).diff().fillna(True).cumsum()).filter(lambda x:x.size>=3)

2017-01-06     145
2017-01-07    1455
2017-01-08     199
2017-01-09     188
Freq: D, dtype: int64

In [ ]:
# select distinct a.*
# from stadium a, stadium b, stadium c
# where a.people>=100 and b.people>=100 and c.people>=100
# and ((a.id=b.id+1 and b.id=c.id+1) 
# or (b.id=a.id+1 and a.id=c.id+1) 
# or (b.id=c.id+1 and c.id=a.id+1))
# order by a.id

185.department_top_salary

Write a SQL query to find employees who earn the top three salaries in each of the department.

In [170]:
employee = pd.DataFrame({
    'name':list('abcdef'),
    'salary':[7000,6000,8000,9000, 6900, 8500],
    'department':[1,2,2,1,1,1]
})
department = pd.DataFrame({
    'id': [1,2],
    'name':['IT','Sales']
})

In [181]:
employee.groupby('department').apply(lambda x: x[x.salary.isin(sorted(x.salary.unique(), reverse=True)[:3])]).merge(department, left_on='department', right_on='id')

   department name_x  salary  id name_y
0           1      a    7000   1     IT
1           1      d    9000   1     IT
2           1      f    8500   1     IT
3           2      b    6000   2  Sales
4           2      c    8000   2  Sales

In [ ]:
# select d.Name as 'Department', a.Name as 'Employee', a.Salary
# from Employee as a
# join Department as d on d.Id=a.DepartmentId
# where 3 >
# (select count(distinct b.Salary)
# from Employee as b
# where b.Salary>a.Salary and a.DepartmentId=b.DepartmentId)